#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
tfcloud relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infrastructure/infrastructure/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infrastructure/infrastructure

To view this run in a browser, visit:
https://app.terraform.io/app/justinyeoh/terraform_cloud/runs/run-Mb6pwTfF4ncoV8LT

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tfe_workspace.minecraft will be created
  + resource "tfe_workspace" "minecraft" {
      + allow_destroy_plan            = false
      + auto_apply                    = true
      + execution_mode                = "remote"
      + file_triggers_enabled         = false
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "minecraft"
      + operations                    = (known after apply)
      + organization                  = "justinyeoh"
      + queue_all_runs                = true
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "tfmanaged",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "aws/minecraft"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Version constraints inside provider configuration blocks are deprecated
│ 
│   on provider.tf line 4, in provider "tfe":
│    4:   version  = "~> 0.26.0"
│ 
│ Terraform 0.13 and earlier allowed provider version constraints inside the
│ provider configuration block, but that is now deprecated and will be
│ removed in a future version of Terraform. To silence this warning, move the
│ provider version constraint into the required_providers block.
╵

```

</details>

*Pusher: @JustinYeoh93, Action: `pull_request`*